note/drawio/converted/dot/260506-sv-rv32i-gpio.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_wHDCfNWy0C5bdR1iGWTU_1" [label="Manager"];
  "n_wHDCfNWy0C5bdR1iGWTU_10" [label="node_WTU-10"];
  "n_wHDCfNWy0C5bdR1iGWTU_11" [label="RAM"];
  "n_wHDCfNWy0C5bdR1iGWTU_111" [label="Control Unit"];
  "n_wHDCfNWy0C5bdR1iGWTU_113" [label="Instruction Memory(ROM)"];
  "n_wHDCfNWy0C5bdR1iGWTU_116" [label="RV32I"];
  "n_wHDCfNWy0C5bdR1iGWTU_117" [label="DataPath"];
  "n_wHDCfNWy0C5bdR1iGWTU_119" [label="Control\nUnit"];
  "n_wHDCfNWy0C5bdR1iGWTU_12" [label="node_WTU-12"];
  "n_wHDCfNWy0C5bdR1iGWTU_121" [label="Master(APB Requester)"];
  "n_wHDCfNWy0C5bdR1iGWTU_122" [label="DataPath"];
  "n_wHDCfNWy0C5bdR1iGWTU_124" [label="Address\nDecoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_125" [label="Control Unit"];
  "n_wHDCfNWy0C5bdR1iGWTU_128" [label="Slave(APB Completer)"];
  "n_wHDCfNWy0C5bdR1iGWTU_129" [label="RAM"];
  "n_wHDCfNWy0C5bdR1iGWTU_13" [label="GPO"];
  "n_wHDCfNWy0C5bdR1iGWTU_130" [label="GPIO"];
  "n_wHDCfNWy0C5bdR1iGWTU_131" [label="GPI"];
  "n_wHDCfNWy0C5bdR1iGWTU_132" [label="GPO"];
  "n_wHDCfNWy0C5bdR1iGWTU_133" [label="FND"];
  "n_wHDCfNWy0C5bdR1iGWTU_135" [label="instr_code[31:0]"];
  "n_wHDCfNWy0C5bdR1iGWTU_137" [label="instr_addr[31:0]"];
  "n_wHDCfNWy0C5bdR1iGWTU_14" [label="GPI"];
  "n_wHDCfNWy0C5bdR1iGWTU_15" [label="GPIO"];
  "n_wHDCfNWy0C5bdR1iGWTU_16" [label="0000_0000"];
  "n_wHDCfNWy0C5bdR1iGWTU_17" [label="0000_FFFF"];
  "n_wHDCfNWy0C5bdR1iGWTU_18" [label="1000_0000"];
  "n_wHDCfNWy0C5bdR1iGWTU_19" [label="1000_FFFF"];
  "n_wHDCfNWy0C5bdR1iGWTU_2" [label="ADDR Decoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_20" [label="2000_0000"];
  "n_wHDCfNWy0C5bdR1iGWTU_21" [label="2000_1000"];
  "n_wHDCfNWy0C5bdR1iGWTU_22" [label="2000_2000"];
  "n_wHDCfNWy0C5bdR1iGWTU_23" [label="2000_3000"];
  "n_wHDCfNWy0C5bdR1iGWTU_26" [label="APB Control Unit"];
  "n_wHDCfNWy0C5bdR1iGWTU_3" [label="node_GWTU-3"];
  "n_wHDCfNWy0C5bdR1iGWTU_30" [label="Instruction Memory\n(ROM)"];
  "n_wHDCfNWy0C5bdR1iGWTU_31" [label="RV32I\n(CPU)"];
  "n_wHDCfNWy0C5bdR1iGWTU_35" [label="Instruction Memory(ROM)"];
  "n_wHDCfNWy0C5bdR1iGWTU_38" [label="RV32I"];
  "n_wHDCfNWy0C5bdR1iGWTU_39" [label="DataPath"];
  "n_wHDCfNWy0C5bdR1iGWTU_4" [label="ROM"];
  "n_wHDCfNWy0C5bdR1iGWTU_41" [label="Control\nUnit"];
  "n_wHDCfNWy0C5bdR1iGWTU_5" [label="node_GWTU-5"];
  "n_wHDCfNWy0C5bdR1iGWTU_51" [label="Master\n(APB Reuqester)"];
  "n_wHDCfNWy0C5bdR1iGWTU_52" [label="Slave\n(APB Completer)"];
  "n_wHDCfNWy0C5bdR1iGWTU_55" [label="Master(APB Requester)"];
  "n_wHDCfNWy0C5bdR1iGWTU_56" [label="DataPath"];
  "n_wHDCfNWy0C5bdR1iGWTU_58" [label="Address\nDecoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_6" [label="ADDR Decoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_64" [label="Slave(APB Completer)"];
  "n_wHDCfNWy0C5bdR1iGWTU_67" [label="RAM"];
  "n_wHDCfNWy0C5bdR1iGWTU_68" [label="GPIO"];
  "n_wHDCfNWy0C5bdR1iGWTU_69" [label="GPI"];
  "n_wHDCfNWy0C5bdR1iGWTU_7" [label="ADDR Decoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_70" [label="GPO"];
  "n_wHDCfNWy0C5bdR1iGWTU_71" [label="FND"];
  "n_wHDCfNWy0C5bdR1iGWTU_8" [label="ADDR Decoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_9" [label="ADDR Decoder"];
  "n_wHDCfNWy0C5bdR1iGWTU_41" -> "n_wHDCfNWy0C5bdR1iGWTU_39";
  "n_wHDCfNWy0C5bdR1iGWTU_58" -> "n_wHDCfNWy0C5bdR1iGWTU_56";
  "n_wHDCfNWy0C5bdR1iGWTU_119" -> "n_wHDCfNWy0C5bdR1iGWTU_117";
  "n_wHDCfNWy0C5bdR1iGWTU_124" -> "n_wHDCfNWy0C5bdR1iGWTU_122";
}
